# Предстои ви да спечелите добри пари,
# но първо трябва да измислите начин да проверите кой е платил за вашия продукт и кой не.

# Решили сте да позволите на хората да използват софтуера за безплатен пробен период
# и след това да изисквате ключ за активиране, за да продължите да използвате продукта.

# Преди да можете да изтеглите парите, последната стъпка е да разработите програма,
# която да създава уникални ключове за активиране за всеки потребител.
# Така че не губете повече време и започнете да пишете!

# Първият ред на входа ще бъде вашият необработен ключ за активиране.
# Той ще се състои само от букви и цифри.

# След това, докато не бъде подадена командата "Генерирай",
# ще получавате низове с инструкции за различни операции,
# които трябва да бъдат извършени върху суровия ключ за активиране.

# Съществуват няколко вида инструкции, разделени с ">>>":
# - "Contains>>>{substring}":
# o Ако необработеният ключ за активиране съдържа дадения подниз,
# извежда: "{суров ключ за активиране} съдържа {подниз}".
# o В противен случай извежда: "Поднизът не е намерен!"

# - "Flip>>>Upper/Lower>>>{startIndex}>>>{endIndex}":
# o Променя подниза между дадените индекси (крайният индекс е изключителен) в главни или малки букви
# и след това извежда активационния ключ.
# o Всички дадени индекси ще бъдат валидни.

# - "Slice>>>{startIndex}>>{endIndex}":
# o Изтрива символите между началния и крайния индекс (крайният индекс е изключителен)
# и отпечатва ключа за активиране.
# o И двата индекса ще бъдат валидни.

# Въвеждане
# - Първият ред на входа ще бъде низ, състоящ се само от букви и цифри.
# - След първия ред, докато не бъде подадена командата "Генерирай", ще се получават низове.
# Изход
# - След получаване на командата "Generate" (Генерирай), отпечатайте:
# o "Вашият ключ за активиране е: {ключ за активиране}"
