# Отново сте забравили паролата си.
# Естествено, това не се случва за първи път.
# Всъщност толкова ви е омръзнало, че сте решили да си помогнете с интелигентно решение.

# Напишете програма за възстановяване на паролата,
# която изпълнява серия от команди по предварително зададен низ.

# Първо ще получите низ, а след това, докато не бъде подадена командата "Готово",
# ще получавате низове с команди, разделени с един интервал.

# Командите ще бъдат следните:
# - "TakeOdd"
# o Взема само символите с нечетни индекси и ги конкатенира, за да получи новата сурова парола,
# след което я отпечатва.

# - "Cut {index} {дължина}"
# o Получава подниза със зададената дължина, започващ от дадения индекс,
# от паролата и премахва първото му появяване, след което отпечатва паролата на конзолата.
# o Даденият индекс и дължина винаги са валидни.

# - "Substitute {substring} (Замяна на {подраздел}) {substitute}"
# o Ако необработената парола съдържа дадения подниз,
# замества всички негови срещания с дадения заместващ текст и отпечатва резултата.
# o Ако не съдържа, отпечатва "Няма нищо за заместване!".

# Въвеждане
# - Ще получавате низове, докато не бъде подадена командата "Готово".
# Изход
# - След като се получи командата "Готово", отпечатайте:
# o "Вашата парола е: {парола}"
# Ограничения
# - Индексите от командата "Cut {index}" са {дължина}" винаги ще бъдат валидни.