# По време на Втората световна война вие сте математик,
# който се присъединява към криптографския екип, за да разшифрова кода на врага "Енигма".
# Вашата задача е да създадете програма за разбиване на кодовете.
# На първия ред на входа ще получите криптираното съобщение.

# След това, докато не бъде подадена командата "Декодирай",
# ще получавате низове с инструкции за различни операции,
# които трябва да се извършат върху скритото съобщение,
# за да се интерпретира и да се разкрие истинското му съдържание.

# Съществуват няколко вида инструкции, разделени с '|'

# - "Преместете {брой букви}":
# o Премества първите n букви в задната част на низа

# - "Insert {index}". {стойност}":
# o Вмъква дадената стойност преди дадения индекс в низ

# - "ChangeAll {substring} {заместване}":
# o Променя всички срещания на дадения подниз с текста за замяна

# Въвеждане / Ограничения
# - На първия ред ще получите низ със съобщение.
# - На следващите редове ще получавате команди, разделени с '|' .
# Изход
# - След получаване на командата "Decode" (Разкодиране) отпечатайте това съобщение:
# "Декриптираното съобщение е: Дешифрираното съобщение е следното: {съобщение}"
