# Вие сте световен пътешественик и следващата ви цел е да направите световна обиколка.
# За да го направите, първо трябва да планирате всичко.
# Като начало бихте искали да планирате всички свои спирки, където ще имате почивка.
# На първия ред ще ви бъде даден низ, съдържащ всички ваши спирки.
# Докато получите командата "Пътуване",
# ще ви бъдат дадени някои команди за манипулиране на този първоначален низ.

# Командите могат да бъдат:
# - "Add Stop:{index}:{string}":
# o Вмъкнете дадения низ в този индекс, само ако индексът е валиден

# - "Премахване на спирка:{начален_индекс}:{краен_индекс}":
# o Премахване на елементите на низ от началния до крайния индекс (включително),
# ако и двата индекса са валидни

# - "Превключване:{стар_низ}:{нов_низ}":
# o Ако старият низ е в началния низ, заменете го с новия (всички случаи)

# Забележка: След всяка команда извеждайте текущото състояние на низа
# След командата "Пътуване" отпечатайте следното: "Готов за световно турне! Планирани спирки: {струна}"

# Въвеждане / Ограничения
# - JavaScript: ще получите списък от низове
# - Индексът е валиден,
# ако се намира между първия и последния индекс на елемента (включително) в последователността.
# Изход
# - Изведете правилните изходни съобщения в правилните случаи,
# както е описано в описанието на проблема



