# Ще получите 3 реда за въвеждане.
# На първия ред ще получите заглавие на статия.
# На следващия ред ще получите съдържанието на тази статия.
# На следващите n реда, докато не получите "край на коментарите", ще получавате коментарите за статията.
# Отпечатайте цялата информация в html формат.

# Заглавието трябва да е в таг "h1" (<h1></h1>);
# съдържанието в етикета на статията (<article></article>);
# всеки коментар трябва да бъде в таг div (<div></div>).
# За повече пояснения вижте примера по-долу
