# Идва последната и най-интересна част - крайното класиране на кандидат-стажантите.
#  Крайното класиране се определя от точките от задачите на интервюто и от изпитите в SoftUni.
# Ето и последната ви задача.
#  Ще получите няколко реда за въвеждане на данни във формат "{конкурс}:{парола за конкурса}",
#  докато получите съобщение "край на конкурсите".

# Запазете тези данни, защото ще ви трябват по-късно.
#  След това ще получавате друг тип входни данни във формат "{конкурс}=>{парола}=>{име на потребителя}=>{точки}",
#  докато получите "край на подадените заявки".

# Ето какво трябва да направите.
# - Проверете дали конкурсът е валиден (ако сте го получили в първия тип вход)
# - Проверете дали паролата е правилна за дадения конкурс
# - Запазете потребителя с конкурса, в който участва (един потребител може да участва в много конкурси),
# и точките, които потребителят има в дадения конкурс.
# - Ако получите един и същ конкурс и един и същ потребител, актуализирайте точките само ако новите са повече от старите.

# Накрая трябва да отпечатате информацията за потребителя с най-много точки
# във формат "Най-добрият кандидат е {потребител} с общо {общо точки} точки.".

# След това отпечатайте всички ученици, подредени по имената им.
# За всеки потребител отпечатайте всеки конкурс с точките в низходящ ред. Вижте примерите.

# Вход
# - Редове във формат "{конкурс}:{парола за конкурса}" до командата "край на конкурсите". Няма да има случай с два еднакви конкурса
# - Поредици във формат "{конкурс}=>{парола}=>{име на потребителя}=>{точки}" до командата "край на подадените заявки".
# - Няма да има случай с 2 или повече потребители с еднакъв общ брой точки!

# Изход
# - На първия ред изведете най-добрия потребител във формат "Най-добрият кандидат е {потребител} с общ брой точки {общ брой точки}.".

# - След това отпечатайте всички ученици, подредени както е посочено по-горе, във формат:
# {име на потребителя1}
# # {Състезание1} -> {точки}
# # {конкурс2} -> {точки}

# Ограничения
# - низовете могат да съдържат всеки ASCII символ, освен от (:, =, >)
# - числата ще бъдат в диапазона [0 - 10000]
# - вторият вход е винаги валиден

