# Пешо е професионален играч на MOBA, който се бори да стане а майстор на ниво Challenger.
#  Затова внимателно следи статистиката в това ниво.
# Ще получите няколко входни реда в един от следните формати:
# "{играч} -> {позиция} -> {умение}"
# "{играч} срещу {играч}"

# Играчът и позицията са низове, а зададеното умение ще бъде цяло число.
# Трябва да следите всеки играч.
# Когато получите играч, неговата позиция и умение, добавете го към пула от играчи, ако няма такъв,
#  в противен случай добавете позицията и умението му
#  или актуализирайте умението му, само ако умението на настоящата позиция е по-ниско от новата стойност.

# Ако получите "{играч} срещу {играч}" и двамата играчи съществуват в подреждането, те се дуелират по следните правила:
# Сравняват позициите си, ако имат поне една обща, печели играчът с по-добър общ брой точки за умение,
# а другият се понижава от нивото -> премахва се.
# Ако имат еднакви общи точки за умения, дуелът е равен и двамата продължават в Сезона.
# Ако нямат общи позиции, дуелът не се провежда и двамата продължават в Сезона.
# Трябва да прекратите програмата си, когато получите командата "Край на сезона".

# At that point you should print the players, ordered by total skill in desecending order, then ordered by player name in ascending order
#  В този момент трябва да отпечатате играчите, подредени по общо умение (total skill) в низходящ ред,
#  а след това подредени по име на играч във възходящ ред.

# За всеки играч отпечатайте позицията и уменията му, подредени в низходящ ред по уменията,
# а след това подредени по името на позицията във възходящ ред.

# Входни данни / ограничения
# - Входните данни са под формата на команди в един от посочените по-горе формати.
# - Играчът и позицията винаги ще бъдат еднословни низове, които не съдържат бели полета.
# - Умението ще бъде цяло число в диапазона [0, 1000].
# - Няма да има невалидни входни редове.
# - Програмата приключва, когато получите командата "Край на сезона".
# Изходни данни
# - Форматът на изхода за всеки играч е:
# "{играч}: {totalSkill} умение"
# "- {позиция} <::> {умение}"
