# Докато не бъде подадена командата "Отплавай", ще получавате:
# - Вие и вашият екипаж сте се насочили към градове с тяхното население и злато, разделени с "||".

# - Ако получите град, който вече е бил получен, трябва да увеличите населението и златото с дадените стойности.

# След командата "Sail" (Плаване) ще започнете да получавате редове с текст, представящи събития,
# докато не бъде подадена командата "End" (Край).
# Събитията ще бъдат в следния формат:
# • "Plunder=>{town}=>{people}=>{gold}"
# o Успешно сте нападнали и ограбили града, като сте убили дадения брой хора
# и сте откраднали съответното количество злато.

# o За всеки нападнат град извеждайте това съобщение: "{град} ограбен! Откраднато е {злато} злато, убити са {хора} граждани."
# o Ако някоя от тези две стойности (население или злато) достигне нула, градът се разпуска.

# Трябва да го премахнете от колекцията си от целеви градове и да отпечатате следното съобщение: "{град} е изтрит от картата!"
# o Няма да има случай на получаване на повече население или злато, отколкото има в града.

# - "Prosper=>{град}=>{злато}"
# o В дадения град е имало драматичен икономически растеж, който е увеличил хазната му с даденото количество злато.
# o Количеството злато може да бъде отрицателно число, така че бъдете внимателни.

# Ако е дадено отрицателно количество злато,отпечатайте: "Добавеното злато не може да бъде отрицателно число!"
# и игнорирайте командата.

# o Ако даденото количество злато е валидно, увеличете златните резерви на града със съответната сума и изведете следното
# съобщение: "Златото е отрицателно число:

# "Добавено е злато в градската хазна. {Сега градът разполага с {общо злато} злато."

# Въвеждане
# - На първите редове, до командата "Sail", ще получавате низове, представляващи градовете с тяхното злато и население,
# разделени с "||".
# - На следващите редове до командата "End" ще получавате низове, представляващи описаните по-горе действия,
# разделени с "=>".

# Изходни данни
# - След получаване на командата "End", ако в списъка с цели има съществуващи селища, трябва да изведете всички тях в
# следния формат:
# "Ahoy, Captain! Има {броя} богати селища, към които трябва да се насочите:
# {град1}. -> Население: {човеци} граждани, злато: {злато} кг
# {град2} -> Население: {човек} граждани, злато: {злато} кг
#    ...
# {град...n} -> Население: {народ} граждани, злато: {злато} кг"
# - Ако не са останали селища за ограбване, отпечатайте:
# "Ахой, капитане! Всички цели са ограбени и унищожени!"
# Ограничения
# - Първоначалното население и златото на селищата трябва да бъдат валидни 32-битови цели числа, никога отрицателни
# или да надвишават съответните граници.
# - Имената на градовете в събитията винаги ще бъдат валидни градове, които трябва да бъдат във вашия списък.
