# Снежанка обича джуджетата си, но те са толкова много и тя не знае как да ги подреди.
# Трябва ли да ги подрежда по име? Или по цвета на шапката им? Или по физика? Тя не може да реши,
# затова от вас зависи да напишете програма, която да го направи вместо нея.

# Ще получите няколко входни реда, които съдържат данни за джуджетата в следния формат:
# {име на джуджето} <:> {цвят на шапката на джуджето} <:> {dwarfPhysics}
# Име на джуджето и цвят на шапката на джуджето са низове. dwarfPhysics е цяло число.

# Трябва да съхранявате джуджетата във вашата програма.
# Съществуват обаче няколко правила:

# - Ако 2 джуджета имат едно и също име, но различен цвят, те трябва да се считат за различни джуджета и трябва да съхранявате и двете.
# - Ако 2 джуджета имат едно и също име и един и същ цвят, съхранявайте това с по-висока физика.

# Когато получите командата "Имало едно време", въвеждането приключва.

# Трябва да подредите джуджетата по физика в низходящ ред и след това по общ брой джуджета с един и същ цвят на шапката в низходящ ред.
# След това трябва да ги отпечатате всички.

# Въвеждане
# - Входът се състои от няколко входни реда, съдържащи данни за джуджетата във формата, посочен по-горе.
# - Въвеждането приключва, когато получите командата "Имало едно време".
# Изход
# - Като изход трябва да отпечатате джуджетата, подредени по начина, посочен по-горе.
# - Форматът на изхода е: ({hatColor}) {име} <-> {физика}
# Ограничения
# - Името на джуджето ще бъде низ, който може да съдържа всеки ASCII символ с изключение на ' ' (интервал), '<', ':', '>'.
# - Цвят на шапката на джуджето ще бъде низ, който може да съдържа всеки ASCII символ с изключение на ' ' (интервал), '<', ':', '>'.
# - dwarfPhysics ще бъде цяло число в диапазона [0, 2на 31 степен - 1].
# - Няма да има невалидни входни редове.
# - Ако всички критерии за сортиране са неуспешни, редът трябва да е по реда на въвеждане.
# - Позволено време за работа / памет: 100 ms / 16MB.
