# Попаднали сте в ръцете на най-новото обновление на най-добрата MMORPG игра на всички времена - Heroes of Code and Logic.
#  Искате да я играете по цял ден! Затова отменете всички други уговорки и създайте своето парти!
#
# На първия ред на стандартния вход ще получите цяло число n - броят на героите, които можете да изберете за вашата партия.
#  На следващите n реда ще последват самите герои с техните точки на поражение и точки на мана,
#  разделени с един интервал в следния формат:

# "{име на герой} {HP} {MP}"
# - HP означава точки на поражение, а MP - точки на мана
# - един герой може да има максимум 100 HP и 200 MP

# След като успешно сте избрали героите си, можете да започнете да играете играта.
# Ще получавате различни команди, всяка на нов ред, разделени с " - ", докато не бъде подадена командата "Край".

# Съществуват няколко действия, които героите могат да извършват:
# "CastSpell - {име на герой} - {MP needed} - {име на заклинание}"
# - Ако героят разполага с необходимите МР, той изрича заклинанието, като по този начин намалява своите МР.
# Отпечатайте това съобщение:
# o "{името на героя} успешно изрече {името на заклинанието} и сега има {останали точки мана}. MP!"
# - Ако героят не е в състояние да произнесе заклинанието, отпечатайте:
# o "{името на героя} няма достатъчно MP, за да произнесе {името на заклинанието}!"

# "TakeDamage - {име на герой} - {damage} - {нападател}"
# - Намалява HP на героя със зададеното количество щети.
# Ако героят е все още жив (HP-то му е по-голямо от 0), отпечатайте:
# o "{името на героя} беше ударен за {увреждане} HP от {нападател} и сега му остават {текущи HP} HP!"
# - Ако героят е умрял, извадете го от партията си и отпечатайте:
# o "{името на героя} е убит от {нападател}!"

# "Презареждане - {име на герой} - {сума}"
# - Героят увеличава своите MP.
# Ако той доведе до увеличаване на МР на героя над максималната стойност (200), МР се увеличава до 200.
# (МР не може да надхвърли максималната стойност).
# - Извежда се следното съобщение:
# o "{името на героя} е презаредено за {възстановена сума}. MP!"

# "Излекуване - {име на герой} - {сума}"
# - Героят увеличава своята HP.
# Ако е подадена команда, която би довела до увеличаване на HP на героя над максималната стойност (100),
# HP се увеличава до 100 (HP не може да надхвърли максималната стойност).
# - Извежда се следното съобщение:
# o "{името на героя} се излекува за {количество възстановени} HP!"

# Въвеждане
# - На първия ред на стандартния вход ще получите цяло число n
# - На следващите n реда ще последват самите герои с техните точки на поражение и точки на мана,
# разделени с интервал в следния формат
# - Ще получавате различни команди, всяка на нов ред, разделени с " - ", докато не бъде подадена командата "End".
# Изход
# - Изведете всички членове на вашата партия, които са все още живи, в следния формат
# (техните HP/MP трябва да бъдат отделени с 2 интервала):
# "{име на герой}
#   HP: {текуща HP}
#   MP: {current MP}"
# Ограничения
# - Началните HP/MP на героите ще бъдат валидни, 32-битови цели числа,
# които никога няма да бъдат отрицателни или да надвишават съответните граници.
# - Сумите на HP/MP в командите никога няма да бъдат отрицателни.
# - Имената на героите в командите винаги ще бъдат валидни членове на вашата партия.
# Не е необходимо да проверявате това изрично.

