# Току-що сте си купили най-новата и най-добрата компютърна игра - Need for Seed III.
# Изберете любимите си автомобили и ги карайте, колкото искате! Знаем, че нямате търпение да започнете да играете.

# На първия ред на стандартния вход ще получите цяло число n - броят на автомобилите, които можете да получите.
# На следващите n реда ще последват самите автомобили с техния пробег и налично гориво, разделени с "|" в следния формат:
# "{car}|{mileage}|{fuel}"

# След това ще получавате различни команди, всяка на нов ред, разделени с " : ", докато не бъде подадена командата "Stop":
# - "Drive : {car} : {distance} : {fuel}":
# o Трябва да изминете зададеното разстояние и за това ще ви е необходимо даденото гориво.
# o Ако автомобилът няма достатъчно гориво, изпишете: "Няма достатъчно гориво за това пътуване"

# o Ако автомобилът има необходимото налично гориво в резервоара, увеличете пробега му с даденото разстояние,
# намалете горивото му с даденото гориво и отпечатайте: "Намали пробега с даденото гориво:
# "{автомобил} измина {разстояние} километри. {гориво} литри изразходвано гориво."

# o Обичате да шофирате само нови автомобили, така че ако пробегът на даден автомобил достигне 100 000 км,
# премахнете го от колекцията(ите) и отпечатайте: "Време е да продадете {автомобила}!"

# - "Презареждане с гориво : {автомобил} : {гориво}":
# o Напълнете резервоара на вашия автомобил.
# o Всеки резервоар може да побере максимум 75 литра гориво, така че ако даденото количество гориво е повече,
# отколкото можете да поберете в резервоара, вземете само необходимото за зареждане.
# o Отпечатайте съобщение в следния формат: "{автомобил} зареден с {гориво} литри"

# - "Върнете: {car} : {kilometers}":
# o Намалете пробега на дадения автомобил със зададените километри и отпечатайте километрите, с които сте го намалили,
# в следния формат:
# "{car} mileage decreased by {amount reverted} kilometers"

# o Ако пробегът стане по-малък от 10 000 км след намаляването му, просто го задайте на 10 000 км и
# НЕ отпечатвайте нищо.

# При получаване на командата "Стоп" трябва да отпечатате всички притежавани от вас автомобили,
# подредени по пробег в низходящ ред, а след това по име във възходящ ред, в следния формат:
# "{автомобил} -> Пробег: {пробег} км, Гориво в резервоара: {гориво} lt."

# Входни данни/ограничения
# - Пробегът и горивото на автомобилите ще бъдат валидни, 32-битови цели числа и никога няма да бъдат отрицателни.
# - Количествата гориво и разстояние в командите никога няма да бъдат отрицателни.
# - Имената на автомобилите в командите винаги ще бъдат валидни автомобили, които притежавате.
# Изходни данни
# - Всички изходни съобщения с подходящи формати са описани в описанието на задачата.
