# Вече се завърнахте от световното си турне.
# По пътя си сте открили някои нови растения и искате да съберете информация за тях и да създадете изложба,
# за да видите кое растение е оценено най-високо.

# На първия ред ще получите число n.
# На следващите n реда ще получите някаква информация за растенията, които сте открили във формата: "{plant}<->{rarity}".

# Съхранявайте тази информация, защото тя ще ви е необходима по-късно.

#  Ако получите растение повече от веднъж, актуализирайте неговата рядкост.

# След това, докато не получите командата "Изложба", ще ви бъдат дадени някои от тези команди:

# - "Rate: {растение} - {оценка}" - добавете дадената оценка към растението (запазете всички оценки)
# - "Update: {plant} - {new_rarity}" - актуализира рядкостта на растението с новата
# - "Reset: {plant}" - премахва всички рейтинги на даденото растение

# Забележка: Ако дадено име на растение е невалидно, се отпечатва "error".

# След командата "Изложба" отпечатайте информацията, която имате за растенията, в следния формат:
# "Растения за изложбата:
# - {име_растение1}; рядкост: {рядкост}; рейтинг: Растения: {средна_оценка}
# - {име_растение2}; рядкост: {рядкост}; оценка: {средна_оценка}
# ...
# - {plant_nameN}; Rarity: {rarity}; Rating: {среден_рейтинг}"
# Растенията трябва да бъдат подредени по рядкост в низходящ ред.
# Ако две или повече растения имат еднаква стойност на рядкост, подредете ги по средна оценка в низходящ ред.
# Средната оценка трябва да се форматира до втория знак след десетичната запетая.
# Входни данни / ограничения
# - Ще получите входните данни, както е описано по-горе
# - JavaScript: ще получите списък от низове
# Изход:
# - Отпечатване на информацията за всички растения, както е описано по-горе
