# Вие сте пианист и обичате да си водите списък с любимите си пиеси за пиано.
# Създайте програма, която да ви помогне да го организирате и да добавяте, променяте, премахвате пиеси от него!

# На първия ред на стандартния вход ще получите цяло число n - броят на пиесите, с които ще разполагате първоначално.
# На следващите n реда ще последват самите пиеси с техния композитор и ключ,
# разделени с "|" в следния формат: "{piece}|{composer}|{key}".

# След това ще получавате различни команди, всяка на нов ред, разделени с "|", докато не бъде подадена командата"Stop":
# - "Add|{piece}|{composer}|{key}":
# o Трябва да добавите даденото парче с информацията за него към другите парчета и да го отпечатате:
# "{композиция} от {композитор} в {ключ} добавена към колекцията!"
# o Ако произведението вече е в колекцията, отпечатайте:
# "Парчето} вече е в колекцията!"
#
# - "Премахване|{композиция}":
# o Ако произведението е в колекцията, премахнете го и отпечатайте:
# "Успешно премахнахме {piece}!"
# o В противен случай изведете:
# "Невалидна операция! {piece} не съществува в колекцията."
#
# - "ChangeKey|{piece}|{new key}":
# o Ако парчето е в колекцията, сменете ключа му с дадения и изведете:
# "Промени ключа на {дял} на {нов ключ}!"
# o В противен случай изведете:
# "Невалидна операция! Парчето {piece} не съществува в колекцията."
#
# При получаване на командата "Стоп" трябва да отпечатате всички произведения в колекцията,
# подредени по имената им и по името на техния композитор в азбучен ред, в следния формат:
# "{Piece} -> Composer: {composer}, Key: Композитор: {ключ}"

# Входни данни/ограничения
# - Първоначално ще получите едно цяло число - първоначалния брой на произведенията в колекцията
# - За всяко парче ще получите един ред текст с информация за него.
# - След това ще получавате множество команди по начина, описан по-горе, до командата "Stop".
# Изход
# - Всички изходни съобщения със съответните формати са описани в описанието на задачата.
