# Наков харесва математиката.
# Но също така много харесва и английската азбука.
# Той измисля игра с числа и букви от английската азбука.
# Играта е проста. Получавате низ, състоящ се от число между две букви.

# В зависимост от това дали буквата е пред числото или след него,
# вие извършвате различни математически действия върху числото, за да постигнете резултат.

# Първо започвате с буквата преди числото.
# - Ако тя е главна, разделяте числото на позицията на буквата в азбуката.
# - Ако тя е малка, умножавате числото с позицията на буквата в азбуката.

# След това преминавате към буквата след числото.
# - Ако тя е главна, изваждате нейната позиция от полученото число.
# - Ако е малка буква, прибавяте нейната позиция към полученото число.
# Но играта много бързо стана твърде лесна за Наков.

# Той решил да я усложни малко, като направи същото, но с няколко низа,
# като следи само общата сума на всички резултати.

# След като започнал да решава това с повече низове и по-големи числа,
# станало доста трудно да го прави само в ума си.

# Затова той любезно ви моли да напишете програма, която изчислява сумата на всички числа,
# след като са извършени операциите върху всяко число.

# Например, дадена ви е последователността "A12b s17G":
# Имаме два низа - "A12b" и "s17G".
# Извършваме операциите върху всяка от тях и ги сумираме.

# Започваме с буквата преди числото в първия низ.
# А е главна буква и позицията ѝ в азбуката е 1.
# Така че разделяме числото 12 с позицията 1 (12/1 = 12).

# След това преминаваме към буквата след числото.
#    b е малка буква и позицията ѝ е 2. Така че добавяме 2 към полученото число (12+2=14).
#   По същия начин за втория низ s е малка буква и позицията ѝ е 19, така че я умножаваме с числото (17*19 = 323).
#   След това имаме главна буква G с позиция 7, така че я изваждаме от полученото число (323 - 7 = 316).
#   Накрая събираме двата резултата и получаваме 14 + 316=330.

# Вход
# Входът идва от конзолата като един ред, съдържащ последователност от низове.
# Низовете са разделени с един или повече бели интервали.
# Входните данни винаги ще бъдат валидни и в описания формат.
# Не е необходимо да ги проверявате изрично.

# Изходни данни
# Извежда в конзолата едно число: общата сума на всички обработени числа,
# закръглена до две цифри след десетичния разделител.

# Ограничения
# Броят на низовете ще бъде в интервала [1 ... 10].
# - Числата между буквите ще бъдат цели числа в интервала [1 ... 2 147 483 647].
# - Ограничение на времето: 0,3 сек. Ограничение на паметта: 16 MB.
# Примери
