# Всеки геймър знае какво означава "яростно напускане".
# В общи линии това е, когато просто не сте достатъчно добри и обвинявате всички останали за загубата на играта.
# Натискате клавиша CAPS LOCK на клавиатурата и заливате чата с небивалици, за да покажете разочарованието си.
# Чочко е геймър, и то лош.
# Той ви моли за помощ;

# иска да бъде най-досадното дете в отбора си, така че когато яростно се отказва, иска нещо наистина грандиозно.
# Той ще ви даде поредица от низове, последвани от неотрицателни числа, например "a3";
# трябва да отпечатате на конзолата всеки низ, повторен N пъти;
# преди това преобразувайте буквите в главни. В примера трябва да изпишете обратно "AAA".

# На изхода първо изведете статистика за броя на използваните уникални символи
# (големината на буквите е без значение, което означава, че "a" и "A" са еднакви);
# форматът трябва да бъде "Unique symbols used {0}".
# След това отпечатайте самото съобщение за ярост.
# Редовете и числата няма да бъдат разделени с нищо.
# Входът винаги ще започва с низ, а за всеки низ ще има съответстващо число.
# Целият вход ще бъде даден на един ред; Чочко е твърде мързелив, за да улесни работата ви.

# Въвеждане
# - Входните данни трябва да се четат от конзолата.
# - Тя се състои от един ред, съдържащ поредица от последователности от низове и числа.
# - Входните данни винаги ще бъдат валидни и в описания формат. Не е необходимо да ги проверявате изрично.

# Изходни данни
# - Изходните данни трябва да се отпечатат на конзолата. Той трябва да се състои от точно два реда.
# - На първия ред отпечатайте броя на уникалните символи, използвани в съобщението.
# - На втория ред отпечатайте самото получено съобщение за ярост.

# Ограничения
# - Броят на двойките низ-число ще бъде в интервала [1 ... 20 000].
# - Всеки низ ще съдържа всякакви символи, освен цифри.
# Дължината на всеки низ ще бъде в интервала [1 ... 20].
# - Броят на повторенията за всеки низ ще бъде цяло число в интервала [0 ... 20].
# - Позволено време за работа на вашата програма: 0,3 секунди. Разрешена памет: 64 MB.
