# Лотарията е вълнуваща.
# Това, което не е, е да проверявате милион билета за печалба само на ръка.

# Затова ви е възложена задачата да създадете програма,
# която автоматично да проверява дали даден билет е печеливш.

# Дадена ви е колекция от билети, разделени със запетаи и интервали.
# Трябва да проверите всеки от тях дали съдържа печеливша комбинация от символи.
# Валидният билет трябва да съдържа точно 20 символа.
# Печелившите символи са "@", "#", "$" и "^".

# Но за да е печеливш един билет, символът трябва да се повтори непрекъснато поне 6 пъти както в лявата,
# така и в дясната половина на билета.
# Например, валиден печеливш билет трябва да има следния вид:
# "Cash$$$$$$Ca$$$$$$sh"
# Лявата половина на билета "Cash$$$$$$" съдържа символа "$$$$$$",
# който се съдържа и в дясната половина на билета "Ca$$$$$$sh".

# Печелившият билет трябва да съдържа символи, повтарящи се до 10 пъти в двете половини,
# което се счита за джакпот (например: "$$$$$$$$$$$$$$$$$$$$").

# Въвеждане

# Входните данни ще се четат от конзолата.
# Входът се състои от един ред, съдържащ всички билети,
# разделени със запетаи и един или повече бели интервали във формат:
# - "{билет}, {билет}, ... {билет}"

# Изход
# Извежда резултата за всеки билет в реда на появата му, всеки на отделен ред във формат:
# - Невалиден билет - "invalid ticket"
# - Няма съвпадение - "ticket "{ticket}" - no match"
# - Съвпадение с дължина от 6 до 9 - "ticket "{ticket}" - {match length}{match symbol}"
# - Съвпадение с дължина 10 - "билет "{ticket}" - {дължина на съвпадение}{символ на съвпадение} Джакпот!"
# Ограничения
# - Броят на билетите ще бъде в интервала [0 ... 100].
